DictionaryManager/app/views/dictionaries/show.html.erb

<!-- Show a list of entries -->
<% if @dictionary.entries.count > 0 %>
---
SELECT COUNT(*) FROM "entries" WHERE "entries"."dictionary_id" = 37