DictionaryManager/app/controllers/dictionaries_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
---
  def show
    # 1. Prepare a paginated entry list
    @dictionary = Dictionary.find(params[:id])
    @paginated_entries = @dictionary.entries.paginate page: params[:entries_page], per_page: 15
    @n_entries = @dictionary.entries.count

    # 2. Prepare a paginated new_entry list
    @user_dictionary = @dictionary.user_dictionaries.where(user_id: current_user.id).first
    @n_new_entries = 0
    if not @user_dictionary.nil?
      @paginated_new_entries = @user_dictionary.new_entries.paginate page: params[:new_entries_page], per_page: 10