DictionaryManager/app/controllers/dictionaries_controller.rb

SELECT "dictionaries".* FROM "dictionaries" ORDER BY view_title
---
  def index
    @dictionaries = Dictionary.all

SELECT "dictionaries".* FROM "dictionaries" WHERE "dictionaries"."id" = $1 ORDER BY title LIMIT 1  [["id", "37"]]
SELECT "user_dictionaries".* FROM "user_dictionaries" WHERE "user_dictionaries"."dictionary_id" = 37 AND "user_dictionaries"."user_id" = 1 LIMIT 1
---
  def show
    @dictionary = Dictionary.find(params[:id])
    @user_dictionary = @dictionary.user_dictionaries.where(user_id: current_user.id).first

SELECT "entries".* FROM "entries" WHERE "entries"."dictionary_id" = 37 ORDER BY view_title LIMIT 15 OFFSET 0
SELECT COUNT(*) FROM "entries" WHERE "entries"."dictionary_id" = 37
---
      # 1. Prepares a paginated_entriesginated entry list.

      if sort_dictionary == "base_dic"
        @paginated_entries = @dictionary.entries.reorder(sort_column + " " + sort_direction).paginate(page: params[:entries_page], per_page: 15)

SELECT "new_entries".* FROM "new_entries" WHERE "new_entries"."user_dictionary_id" = 8 LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "new_entries" WHERE "new_entries"."user_dictionary_id" = 8
---
      @n_new_entries   = 0
      if not @user_dictionary.nil?
        if sort_dictionary == "user_dic"
          @paginated_new_entries = @user_dictionary.new_entries.reorder(sort_column + " " + sort_direction).paginate page: params[:new_entries_page], per_page: 10

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
INSERT INTO "dictionaries" ("created_at", "creator", "description", "hyphen_replaced", "lowercased", "stemmed", "title", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    # Creates a dictionary
    user = User.find(current_user.id)

    @dictionary = user.dictionaries.new( params[:dictionary] )
    @dictionary.creator = current_user.email

    b_basedic_saved = @dictionary.save

SELECT "dictionaries".* FROM "dictionaries" WHERE "dictionaries"."id" = $1 ORDER BY title LIMIT 1  [["id", "37"]]
DELETE FROM "dictionaries" WHERE "dictionaries"."id" = $1  [["id", 37]]
DELETE FROM "entries" WHERE "entries"."id" = $1  [["id", 1326344]]
SELECT "entries".* FROM "entries" WHERE "entries"."dictionary_id" = 37 ORDER BY view_title
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
---
  def destroy
    @dictionary = Dictionary.find(params[:id])

    respond_to do |format|
      if is_current_user_same_to_creator?(@dictionary)
        ## This is too slow.
        # @dictionary.destroy

        ## Much faster than destroy.
        # Deletes entries of the dictionary.
        Entry.where("dictionary_id = ?", @dictionary.id).delete_all

        # Deletes new and removed entries of the associated user dictionaries.
        @dictionary.user_dictionaries.all.each do |userdic|