DictionaryManager/app/controllers/entries_controller.rb

  def new
    # 1. Get the current dictionary
    @dictionary = Dictionary.find(params[:dictionary_id])
---
SELECT "dictionaries".* FROM "dictionaries" WHERE "dictionaries"."id" = $1 ORDER BY title LIMIT 1  [["id", "38"]]

  def destroy
    @dictionary = Dictionary.find(params[:dictionary_id])
    @entry      = @dictionary.entries.find(params[:id])

    # 1. Get (or create) a user dictionary
    user_dictionary = get_user_dictionary(current_user.id, @dictionary.id)

    # 2. Remove (or restore) a base dictionary's entry
    if user_dictionary.removed_entries.nil?
      register_removed_entry(user_dictionary, @entry)
    else
      removed_entry = user_dictionary.removed_entries.where(entry_id: @entry.id).first

      if removed_entry.nil?
        register_removed_entry(user_dictionary, @entry)
      else
        removed_entry.destroy
---
SELECT "dictionaries".* FROM "dictionaries" WHERE "dictionaries"."id" = $1 ORDER BY title LIMIT 1  [["id", "38"]]
SELECT "entries".* FROM "entries" WHERE "entries"."dictionary_id" = 38 AND "entries"."id" = $1 ORDER BY view_title LIMIT 1  [["id", "1326444"]]
SELECT "removed_entries".* FROM "removed_entries" WHERE "removed_entries"."user_dictionary_id" = 8 AND "removed_entries"."entry_id" = 1326444 LIMIT 1
DELETE FROM "removed_entries" WHERE "removed_entries"."id" = $1  [["id", 27]]