DictionaryManager/app/controllers/new_entries_controller.rb

  def create
    # 1. Create a new new_entry for the user_dictionary
    user_dictionary = UserDictionary.find(params[:user_dictionary_id])

    dictionary = Dictionary.find(user_dictionary[:dictionary_id])
    norm_opts = { lowercased:       dictionary[:lowercased],
                  hyphen_replaced:  dictionary[:hyphen_replaced],
                  stemmed:          dictionary[:stemmed],
                }

    @new_entry = user_dictionary.new_entries.new(
                  { view_title:   params[:new_entry][:view_title],
                    search_title: normalize_str(params[:new_entry][:view_title], norm_opts),
                    label:        params[:new_entry][:label],
                    uri:          params[:new_entry][:uri],
                  })

    # 2. Find the dictionary that involves the current user dictionary
    @dictionary = Dictionary.find(user_dictionary.dictionary_id)

    # 3. Send a response
    if @new_entry.save
---
SELECT "user_dictionaries".* FROM "user_dictionaries" WHERE "user_dictionaries"."id" = $1 LIMIT 1  [["id", "8"]]
INSERT INTO "new_entries" ("created_at", "label", "search_title", "updated_at", "uri", "user_dictionary_id", "view_title") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def destroy
    @new_entry = NewEntry.find(params[:id])

    # Find the dictionary, which @new_entry belongs to, for redirection
    user_dictionary = UserDictionary.find(@new_entry.user_dictionary_id)
    dictionary      = Dictionary.find(user_dictionary.dictionary_id)

    # Destroy a new_entry in the user_dictionary
    @new_entry.destroy
---
SELECT "new_entries".* FROM "new_entries" WHERE "new_entries"."id" = $1 LIMIT 1  [["id", "26"]]
SELECT "dictionaries".* FROM "dictionaries" WHERE "dictionaries"."id" = $1 ORDER BY title LIMIT 1  [["id", 38]]
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
DELETE FROM "new_entries" WHERE "new_entries"."id" = $1  [["id", 26]]